/*ফাইলের কাজ করার সময় আগে ডেস্কটপে
একটা ফোল্ডার create করে file_dem1.c
ফাইলটা ডেস্কটপের সেই ফোল্ডারে save করবো।
তাহলে কাজ করা সহজ হবে। কারণ কোডটা রান
করলে নতুন ফাইলটা সেই ফোন্ডারেই save হবে।*/
#include<stdio.h>
int main(){
  FILE *file;
  file=fopen("test.txt","w");
 /*ফাইল তৈরি করলাম fopen, w দিয়ে। এবার
 এটাকে file পয়েন্টারে assign করব তাহলে
 নতুন তৈরি হওয়া ফাইলটা file পয়েন্টারে স্টোর
 হবে।*/
 /*w দিলে ফাইলটা আগে থেকে না থাকলে তৈরি
 করে তারপর open করবে। কিন্তু r দিলে তা হবে
 না। r মানে আগে থেকে আছে এমন একটা ফাইল
 খুলে read করবে।*/
 /*এবার if দিয়ে চেক করবো ফাইলটা আদোও
 create হয়েছে কিনা। কন্ডিশনে চেক করব
 file pointer এখনো ফাঁকা(null) কিনা।
 যদি হয় তারমানে এখনো create হয়নি।*/
 if(file==NULL){
   printf("File doesn't exists.");
 }
 else{ 
   printf("File is created or opened.");
/*ফাইলটা যদি open হয়ে থাকে তবে এবার কাজ
হলো কাজ শেষে ফাইলটা ক্লোজ করে দেওয়া।*/
   fclose(file);
 }
  return 0;
}
/*এবার ফোল্ডারটা (display shortcut দিয়ে
নিও) open করলে শুধু file_dem1.c নামের
ফাইলটা দেখতে পাবে। কিন্তু কোডব্লক্স থেকে কোডটা
একবার রান করার পর ফোল্ডারটা open করলে
এবার শুধু text লিখা ফাইলও দেখতে পাবে যাতে
লিখা থাকবে File is created or opened.*/
/*এখন তৈরি হওয়া text.txt (ফোল্ডারে শুধু 
text লিখা থাকবে)একটা ফাঁকা ফাইল। এরপর শিখবো 
কিভাবে এই ফাঁকা ফাইলে text
add করতে হয়।*/
